---
kind: method
id: M:Autodesk.Revit.DB.ColorFillSchemeEntry.GetIntegerValue
source: html/1bdeb04c-e2dc-3c87-9c8e-c1c2886604e2.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.GetIntegerValue Method

Gets the Integer value stored within the entry.

## Syntax (C#)
```csharp
public int GetIntegerValue()
```

## Returns
The Integer value contained in the entry.

## Remarks
This method should only be used if the StorageType property reports the type of the entry as a Integer.